app/Controllers/EpargneController.php

INSERT INTO `epargne` (`id_clients`, `pourcentage`) VALUES ('1', '10')
---
    public function insert(){
        $epargneModel = new EpargneModel();
        $pourcentage = $this->request->getPost('epargne');
        $clients = $this->request->getPost('id_clients');
        $data = [
            'id_clients' => $clients,
            'pourcentage' => $pourcentage
        ];
        try {
            $epargneModel->insert($data);