app/Controllers/PrefixeController.php

INSERT INTO `prefixes` (`prefixes`, `statut`) VALUES ('038', 1)
---
    public function insert(){
        $prefixesModel = new PrefixesModel();
        $prefixes = $this->request->getPost('prefixes');
        $operateurs = $this->request->getPost('operateurid');
        $data = [
            'operateur_id' => $operateurs,
            'prefixes' => $prefixes,
            'statut' => 1
        ];
        try {
            $prefixesModel->insert($data);