app/Controllers/TransfertController.php

SELECT *
FROM `commissions_externes`
 LIMIT 1
SELECT *
FROM `promotion`
 LIMIT 1
---
        $typeOpTransfert = $typeOpModel->where('code', 'transfert')->first();
        $typeOpRetrait = $typeOpModel->where('code', 'retrait')->first();

        $commissionExterneInfo = $commissionsExterneModel->first();
        $pourcentageExterne = $commissionExterneInfo ? $commissionExterneInfo['pourcentage'] : 0;

        $PromotionInfo = $PromotionModel->first();

SELECT *
FROM `prefixes`
SELECT *
FROM `operateurs`
---



        $allPrefixes = $prefixesModel->findAll();
        $allOperateurs = $operateurModel->findAll();

SELECT *
FROM `bareme_frais`
WHERE `type_operation_id` = 3
---
    private function trouverFraisDansBareme($montant, $typeOpId, $baremeFraisModel) {
        $baremes = $baremeFraisModel->where('type_operation_id', $typeOpId)->findAll();