app/Models/BaremeFraisModel.php

    public function insertBaremeFrais($data) {
        return $this->insert($data);
---
INSERT INTO `bareme_frais` (`type_operation_id`, `montant_min`, `montant_max`, `frais`) VALUES ('1', '1000', '3000', '200')