app/Models/EpargneModel.php

    public function getEpargneByClients($id_clients) {
        return $this->select('pourcentage')->where('id_clients', $id_clients)->first();
---
SELECT `pourcentage`
FROM `epargne`
WHERE `id_clients` = 3
 LIMIT 1

    public function updateEpargne($id_clients, $montant){
         return $this->where('id_clients', $id_clients)->set('montant', $montant)->update();
---
UPDATE `epargne` SET `montant` = 0
WHERE `id_clients` = 3