app/Models/SoldeModel.php

    public function getSoldeByUserId($userId) {
        return $this->where('user_id', $userId)->first();
---
SELECT *
FROM `solde`
WHERE `user_id` = 1
 LIMIT 1

    public function updateSolde($userId, $montant) {
        return $this->where('user_id', $userId)->set('montant', $montant)->update();
---
UPDATE `solde` SET `montant` = 235865
WHERE `user_id` = 1