app/Models/TransactionModel.php

SELECT `transactions`.*, `types_operation`.`type_operation`
FROM `transactions`
JOIN `types_operation` ON `types_operation`.`id` = `transactions`.`type_operation_id`
WHERE `transactions`.`user_id` = 3
ORDER BY `transactions`.`date_transaction` DESC
---
    public function getTransactionsByUserId($userId) {
        return $this->select('transactions.*, types_operation.type_operation')
                     ->join('types_operation', 'types_operation.id = transactions.type_operation_id')
                     ->where('transactions.user_id', $userId)
                     ->orderBy('transactions.date_transaction', 'DESC')
                     ->findAll();

INSERT INTO `transactions` (`user_id`, `type_operation_id`, `montant`, `frais`, `frais_externe`, `operateur_destinataire_id`) VALUES (1, 3, 10000, 95, NULL, 1)
---
    public function insertTransaction($data) {
        return $this->insert($data);